Revit 2027 API
StructuralSectionAnalysisParams.SectionArea Property
 Cross section area.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SectionArea { get; set; }
Public Property SectionArea As Double
	Get
	Set
public:
property double SectionArea {
	double get ();
	void set (double value);
}
member SectionArea : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace